Labeled and constrained dimensions between same references are not allowed.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DimLabeledAndEQ { get; }
  Visual Basic
Public Shared ReadOnly Property DimLabeledAndEQ As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DimLabeledAndEQ {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace